In [2]:
import numpy as np
import pandas as pd

In [3]:
sozluk1={"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori":[100,200,300,400]}

In [7]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [8]:
dataFrame1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [9]:
sozluk2={"İsim":["Osman","Levent","Atlas","Fatma"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori":[200,100,50,300]}

In [10]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [11]:
dataFrame2

     İsim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [12]:
sozluk3={"İsim":["Ayşe","Mahmut","Duygu","Nur"],
         "Spor":["Koşu","Yüzme","Badminton","Tennis"],
         "Kalori":[300,400,500,250]}

In [13]:
dataFrame3=pd.DataFrame(sozluk2,index=[8,9,10,11])

In [14]:
dataFrame3

      İsim       Spor  Kalori
8    Osman       Koşu     200
9   Levent      Yüzme     100
10   Atlas       Koşu      50
11   Fatma  Basketbol     300

## concatenation

In [15]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8    Osman       Koşu     200
9   Levent      Yüzme     100
10   Atlas       Koşu      50
11   Fatma  Basketbol     300

In [16]:
#kolonları birleştirmek istiyorsak axis=1 gibi yazarız

## merge

In [50]:
#kaynaştırmak,ortak kolon var ve diğerleri farklı

In [43]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
  "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [44]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [45]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [46]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
  "Kalori":[100,200,150,250]}

In [47]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [48]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [49]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [54]:
maasSozluk={"Isım":["Atıl","Zeynep","Mehmet","Ahmet"],
           "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
            "Maas":[200,300,400,500]}

In [55]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [57]:
maasDataFrame

     Isım  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [58]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [59]:
maasDataFrame["Departman"].nunique()

3

In [60]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [67]:
def bruttenNete(maas):
    maas*0.66

In [68]:
maasDataFrame["Maas"]

0    200
1    300
2    400
3    500
Name: Maas, dtype: int64

In [69]:
maasDataFrame["Maas"].apply(bruttenNete)

0    None
1    None
2    None
3    None
Name: Maas, dtype: object

In [71]:
maasDataFrame.isnull()

    Isım  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [81]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
            "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
            "Karakter Yas":[9,10,50,20,17]
            }

In [82]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [83]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            17

In [87]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     37
                Homer                    50
South Park      Cartman                   9
                Kenny                    10